src/Documents/Перемещение/Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перемещение</name>
  <registerRecords>AccumulationRegister.ОбъектыНаБерегах</registerRecords>
  <attributes>
    <name>Пассажир</name>
    <type>
      <types>CatalogRef.Пассажиры</types>
    </type>
  </attributes>
  <attributes>
    <name>БерегОт</name>
    <type>
      <types>CatalogRef.Берега</types>
    </type>
  </attributes>
  <attributes>
    <name>БерегДо</name>
    <type>
      <types>CatalogRef.Берега</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ОбъектыНаБерегах/ОбъектыНаБерегах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбъектыНаБерегах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пассажир</name>
    <type>
      <types>CatalogRef.Пассажиры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Берег</name>
    <type>
      <types>CatalogRef.Берега</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Перемещение/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОбъектыНаБерегах Расход
	Движения.ОбъектыНаБерегах.Записывать = Истина;
	Движение = Движения.ОбъектыНаБерегах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Пассажир = Пассажир;
	Движение.Берег = БерегОт;
	Движение.Количество = 1;
	
	//регистр ОбъектНаБерегах Приход
	Движения.ОбъектыНаБерегах.Записывать = Истина;
	Движение = Движения.ОбъектыНаБерегах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Пассажир = Пассажир;
	Движение.Берег = БерегДо;
	Движение.Количество = 1;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"Выбрать
		|	ОбъектыНаБерегахОстатки.Пассажир КАК Пассажир,
		|	ОбъектыНаБерегахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОбъектыНаБерегах.Остатки(
		|			,
		|			Берег = &Берег)
		|			КАК ОбъектыНаБерегахОстатки
		|ГДЕ
		|	ОбъектыНаБерегахОстатки.КоличествоОстаток < 0";
		
	Запрос.УстановитьПараметр("Берег", БерегОт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщить("На берегу ''" + БерегОт + "'' не хватает пассажира ''" + Пассажир + "''!");
	КонецЕсли;
	
КонецПроцедуры
